package com.rainbow.common;

import java.io.IOException;
import java.util.regex.Pattern;

/**
 * Created by xuming on 2017/3/30.
 */
public class QueryWordUtil {
    public static final String[] words = new String[] {
            "一乙二十丁厂七卜八人入儿匕几九刁了刀力乃又三干于亏工土士才下寸大丈与万上小口",
            "山巾千乞川亿个夕久么勺凡丸及广亡门丫义之尸己已巳弓子卫也女刃飞习叉马乡丰王开井天夫元无云专丐扎艺木",
            "五支厅不犬太区历歹友尤匹车巨牙屯戈比互切瓦止少曰日中贝冈内水见午牛手气毛壬升夭长仁什片仆化仇币仍仅",
            "斤爪反介父从仑今凶分乏公仓月氏勿欠风丹匀乌勾凤六文亢方火为斗忆计订户认冗讥心尺引丑巴孔队办以允予邓",
            "劝双书幻玉刊未末示击打巧正扑卉扒功扔去甘世艾古节本术可丙左厉石右布夯戊龙平灭轧东卡北占凸卢业旧帅归",
            "旦目且叶甲申叮电号田由只叭史央兄叽叼叫叩叨另叹冉皿凹囚四生矢失乍禾丘付仗代仙们仪白仔他斥瓜乎丛令用",
            "甩印尔乐句匆册卯犯外处冬鸟务包饥主市立冯玄闪兰半汁汇头汉宁穴它讨写让礼训议必讯记永司尼民弗弘出辽奶",
            "奴召加皮边孕发圣对台矛纠母幼丝邦式迂刑戎动扛寺吉扣考托老巩圾执扩扫地场扬耳芋共芒亚芝朽朴机权过臣吏",
            "再协西压厌戌在百有存而页匠夸夺灰达列死成夹夷轨邪尧划迈毕至此贞师尘尖劣光当早吁吐吓虫曲团吕同吊吃因",
            "吸吗吆屿屹岁帆回岂则刚网肉年朱先丢廷舌竹迁乔迄伟传乒乓休伍伏优臼伐延仲件任伤价伦份华仰仿伙伪自伊血",
            "向似后行舟全会杀合兆企众爷伞创肌肋朵杂危旬旨旭负匈名各多争色壮冲妆冰庄庆亦刘齐交衣次产决亥充妄闭问",
            "闯羊并关米灯州汗污江汛池汝汤忙兴宇守宅字安讲讳军讶许讹论讼农讽设访诀寻那迅尽导异弛孙阵阳收阶阴防奸",
            "如妇妃好她妈戏羽观欢买红驮纤驯约级纪驰纫巡寿弄麦玖玛形进戒吞远违韧运扶抚坛技坏抠扰扼拒找批址扯走抄",
            "贡汞坝攻赤折抓扳抡扮抢孝坎均抑抛投坟坑抗坊抖护壳志块扭声把报拟却抒劫芙芜苇芽花芹芥芬苍芳严芦芯劳克",
            "芭苏杆杠杜材村杖杏杉巫极李杨求甫匣更束吾豆两酉丽医辰励否还尬歼来连轩步卤坚肖旱盯呈时吴助县里呆吱吠",
            "呕园旷围呀吨足邮男困吵串员呐听吟吩呛吻吹呜吭吧邑吼囤别吮岖岗帐财针钉牡告我乱利秃秀私每兵估体何佐佑",
            "但伸佃作伯伶佣低你住位伴身皂伺佛囱近彻役返余希坐谷妥含邻岔肝肛肚肘肠龟甸免狂犹狈角删条彤卵灸岛刨迎",
            "饭饮系言冻状亩况床库庇疗吝应这冷庐序辛弃冶忘闰闲间闷判兑灶灿灼弟汪沐沛汰沥沙汽沃沦汹泛沧没沟沪沈沉",
            "沁怀忧忱快完宋宏牢究穷灾良证启评补初社祀识诈诉罕诊词译君灵即层屁尿尾迟局改张忌际陆阿陈阻附坠妓妙妖",
            "姊妨妒努忍劲矣鸡纬驱纯纱纲纳驳纵纷纸纹纺驴纽奉玩环武青责现玫表规抹卦坷坯拓拢拔坪拣坦担坤押抽拐拖者",
            "拍顶拆拎拥抵拘势抱拄垃拉拦幸拌拧拂拙招坡披拨择抬拇拗其取茉苦昔苛若茂苹苗英苟苑苞范直茁茄茎苔茅枉林",
            "枝杯枢柜枚析板松枪枫构杭杰述枕丧或画卧事刺枣雨卖郁矾矿码厕奈奔奇奋态欧殴垄妻轰顷转斩轮软到非叔歧肯",
            "齿些卓虎虏肾贤尚旺具味果昆国哎咕昌呵畅明易咙昂迪典固忠呻咒咋咐呼鸣咏呢咄咖岸岩帖罗帜帕岭凯败账贩贬",
            "购贮图钓制知迭氛垂牧物乖刮秆和季委秉佳侍岳供使例侠侥版侄侦侣侧凭侨佩货侈依卑的迫质欣征往爬彼径所舍",
            "金刹命肴斧爸采觅受乳贪念贫忿肤肺肢肿胀朋股肮肪肥服胁周昏鱼兔狐忽狗狞备饰饱饲变京享庞店夜庙府底疟疙",
            "疚剂卒郊庚废净盲放刻育氓闸闹郑券卷单炬炒炊炕炎炉沫浅法泄沽河沾泪沮油泊沿泡注泣泞泻泌泳泥沸沼波泼泽",
            "治怔怯怖性怕怜怪怡学宝宗定宠宜审宙官空帘宛实试郎诗肩房诚衬衫视祈话诞诡询该详建肃录隶帚屉居届刷屈弧",
            "弥弦承孟陋陌孤陕降函限妹姑姐姓妮始姆迢驾叁参艰线练组绅细驶织驹终驻绊驼绍绎经贯契贰奏春帮玷珍玲珊玻",
            "毒型拭挂封持拷拱项垮挎城挟挠政赴赵挡拽哉挺括垢拴拾挑垛指垫挣挤拼挖按挥挪拯某甚荆茸革茬荐巷带草茧茵",
            "茶荒茫荡荣荤荧故胡荫荔南药标栈柑枯柄栋相查柏栅柳柱柿栏柠树勃要柬咸威歪研砖厘厚砌砂泵砚砍面耐耍牵鸥",
            "残殃轴轻鸦皆韭背战点虐临览竖省削尝昧盹是盼眨哇哄哑显冒映星昨咧昭畏趴胃贵界虹虾蚁思蚂虽品咽骂勋哗咱",
            "响哈哆咬咳咪哪哟炭峡罚贱贴贻骨幽钙钝钞钟钢钠钥钦钧钩钮卸缸拜看矩毡氢怎牲选适秒香种秋科重复竿段便俩",
            "贷顺修俏保促俄俐侮俭俗俘信皇泉鬼侵禹侯追俊盾待徊衍律很须叙剑逃食盆胚胧胆胜胞胖脉胎勉狭狮独狰狡狱狠",
            "贸怨急饵饶蚀饺饼峦弯将奖哀亭亮度迹庭疮疯疫疤咨姿亲音帝施闺闻闽阀阁差养美姜叛送类迷籽娄前首逆兹总炼",
            "炸烁炮炫烂剃洼洁洪洒柒浇浊洞测洗活派洽染洛浏济洋洲浑浓津恃恒恢恍恬恤恰恼恨举觉宣宦室宫宪突穿窃客诫",
            "冠诬语扁袄祖神祝祠误诱诲说诵垦退既屋昼屏屎费陡逊眉孩陨除险院娃姥姨姻娇姚娜怒架贺盈勇怠癸蚤柔垒绑绒",
            "结绕骄绘给绚骆络绝绞骇统耕耘耗耙艳泰秦珠班素匿蚕顽盏匪捞栽捕埂捂振载赶起盐捎捍捏埋捉捆捐损袁捌都哲",
            "逝捡挫换挽挚热恐捣壶捅埃挨耻耿耽聂恭莽莱莲莫莉荷获晋恶莹莺真框梆桂桔栖档桐株桥桦栓桃格桩校核样根索",
            "哥速逗栗贾酌配翅辱唇夏砸砰砾础破原套逐烈殊殉顾轿较顿毙致柴桌虑监紧党逞晒眠晓哮唠鸭晃哺晌剔晕蚌畔蚣",
            "蚊蚪蚓哨哩圃哭哦恩鸯唤唁哼唧啊唉唆罢峭峨峰圆峻贼贿赂赃钱钳钻钾铁铃铅缺氧氨特牺造乘敌秤租积秧秩称秘",
            "透笔笑笋债借值倚俺倾倒倘俱倡候赁俯倍倦健臭射躬息倔徒徐殷舰舱般航途拿耸爹舀爱豺豹颁颂翁胰脆脂胸胳脏",
            "脐胶脑脓逛狸狼卿逢鸵留鸳皱饿馁凌凄恋桨浆衰衷高郭席准座症病疾斋疹疼疲脊效离紊唐瓷资凉站剖竞部旁旅畜",
            "阅羞羔瓶拳粉料益兼烤烘烦烧烛烟烙递涛浙涝浦酒涉消涡浩海涂浴浮涣涤流润涧涕浪浸涨烫涩涌悖悟悄悍悔悯悦",
            "害宽家宵宴宾窍窄容宰案请朗诸诺读扇诽袜袖袍被祥课冥谁调冤谅谆谈谊剥恳展剧屑弱陵祟陶陷陪娱娟恕娥娘通",
            "能难预桑绢绣验继骏球琐理琉琅捧堵措描域捺掩捷排焉掉捶赦堆推埠掀授捻教掏掐掠掂培接掷控探据掘掺职基聆",
            "勘聊娶著菱勒黄菲萌萝菌萎菜萄菊菩萍菠萤营乾萧萨菇械彬梦婪梗梧梢梅检梳梯桶梭救曹副票酝酗厢戚硅硕奢盔",
            "爽聋袭盛匾雪辅辆颅虚彪雀堂常眶匙晨睁眯眼悬野啪啦曼晦晚啄啡距趾啃跃略蚯蛀蛇唬累鄂唱患啰唾唯啤啥啸崖",
            "崎崭逻崔帷崩崇崛婴圈铐铛铝铜铭铲银矫甜秸梨犁秽移笨笼笛笙符第敏做袋悠偿偶偎偷您售停偏躯兜假衅徘徙得",
            "衔盘舶船舵斜盒鸽敛悉欲彩领脚脖脯豚脸脱象够逸猜猪猎猫凰猖猛祭馅馆凑减毫烹庶麻庵痊痒痕廊康庸鹿盗章竟",
            "商族旋望率阎阐着羚盖眷粘粗粒断剪兽焊焕清添鸿淋涯淹渠渐淑淌混淮淆渊淫渔淘淳液淤淡淀深涮涵婆梁渗情惜",
            "惭悼惧惕惟惊惦悴惋惨惯寇寅寄寂宿窒窑密谋谍谎谐袱祷祸谓谚谜逮敢尉屠弹隋堕随蛋隅隆隐婚婶婉颇颈绩绪续",
            "骑绰绳维绵绷绸综绽绿缀巢琴琳琢琼斑替揍款堪塔搭堰揩越趁趋超揽堤提博揭喜彭揣插揪搜煮援搀裁搁搓搂搅壹",
            "握搔揉斯期欺联葫散惹葬募葛董葡敬葱蒋蒂落韩朝辜葵棒棱棋椰植森焚椅椒棵棍椎棉棚棕棺榔椭惠惑逼粟棘酣酥",
            "厨厦硬硝确硫雁殖裂雄颊雳暂雅翘辈悲紫凿辉敞棠赏掌晴睐暑最晰量鼎喷喳晶喇遇喊遏晾景畴践跋跌跑跛遗蛙蛛",
            "蜓蜒蛤喝鹃喂喘喉喻啼喧嵌幅帽赋赌赎赐赔黑铸铺链销锁锄锅锈锋锌锐甥掰短智氮毯氯鹅剩稍程稀税筐等筑策筛",
            "筒筏答筋筝傲傅牌堡集焦傍储皓皖粤奥街惩御循艇舒逾番释禽腊脾腋腔腕鲁猩猬猾猴惫然馈馋装蛮就敦斌痘痢痪",
            "痛童竣阔善翔羡普粪尊奠道遂曾焰港滞湖湘渣渤渺湿温渴溃溅滑湃渝湾渡游滋渲溉愤慌惰愕愣惶愧愉慨割寒富寓",
            "窜窝窖窗窘遍雇裕裤裙禅禄谢谣谤谦犀属屡强粥疏隔隙隘媒絮嫂媚婿登缅缆缉缎缓缔缕骗编骚缘瑟鹉瑞瑰瑙魂肆",
            "摄摸填搏塌鼓摆携搬摇搞塘摊聘斟蒜勤靴靶鹊蓝墓幕蓬蓄蒲蓉蒙蒸献椿禁楚楷榄想槐榆楼概赖酪酬感碍碘碑碎碰",
            "碗碌尴雷零雾雹辐辑输督频龄鉴睛睹睦瞄睫睡睬嗜鄙嗦愚暖盟歇暗暇照畸跨跷跳跺跪路跤跟遣蜈蜗蛾蜂蜕嗅嗡嗓",
            "署置罪罩蜀幌错锚锡锣锤锥锦键锯锰矮辞稚稠颓愁筹签简筷毁舅鼠催傻像躲魁衙微愈遥腻腰腥腮腹腺鹏腾腿鲍猿",
            "颖触解煞雏馍馏酱禀痹廓痴痰廉靖新韵意誊粮数煎塑慈煤煌满漠滇源滤滥滔溪溜漓滚溢溯滨溶溺粱滩慎誉塞寞窥",
            "窟寝谨褂裸福谬群殿辟障媳嫉嫌嫁叠缚缝缠缤剿静碧璃赘熬墙墟嘉摧赫截誓境摘摔撇聚慕暮摹蔓蔑蔡蔗蔽蔼熙蔚",
            "兢模槛榴榜榨榕歌遭酵酷酿酸碟碱碳磁愿需辖辗雌裳颗瞅墅嗽踊蜻蜡蝇蜘蝉嘛嘀赚锹锻镀舞舔稳熏箕算箩管箫舆",
            "僚僧鼻魄魅貌膜膊膀鲜疑孵馒裹敲豪膏遮腐瘩瘟瘦辣彰竭端旗精粹歉弊熄熔煽潇漆漱漂漫滴漾演漏慢慷寨赛寡察",
            "蜜寥谭肇褐褪谱隧嫩翠熊凳骡缩慧撵撕撒撩趣趟撑撮撬播擒墩撞撤增撰聪鞋鞍蕉蕊蔬蕴横槽樱橡樟橄敷豌飘醋醇",
            "醉磕磊磅碾震霄霉瞒题暴瞎嘻嘶嘲嘹影踢踏踩踪蝶蝴蝠蝎蝌蝗蝙嘿嘱幢墨镇镐镑靠稽稻黎稿稼箱篓箭篇僵躺僻德",
            "艘膝膛鲤鲫熟摩褒瘪瘤瘫凛颜毅糊遵憋潜澎潮潭鲨澳潘澈澜澄懂憔懊憎额翩褥谴鹤憨慰劈履豫缭撼擂操擅燕蕾薯",
            "薛薇擎薪薄颠翰噩橱橙橘整融瓢醒霍霎辙冀餐嘴踱蹄蹂蟆螃器噪鹦赠默黔镜赞穆篮篡篷篱儒邀衡膨雕鲸磨瘾瘸凝",
            "辨辩糙糖糕燃濒澡激懒憾懈窿壁避缰缴戴擦藉鞠藏藐檬檐檀礁磷霜霞瞭瞧瞬瞳瞩瞪曙蹋蹈螺蟋蟀嚎赡穗魏簧簇繁",
            "徽爵朦臊鳄癌辫赢糟糠燥懦豁臀臂翼骤藕鞭藤覆瞻蹦嚣镰翻鳍鹰瀑襟璧戳孽警蘑藻攀曝蹲蹭蹬巅簸簿蟹颤靡癣瓣",
            "羹鳖爆疆鬓壤馨耀躁蠕嚼嚷巍籍鳞魔糯灌譬蠢霸露霹躏黯髓赣囊镶瓤罐矗兀弋孑幺韦廿厄",
            "兮爻卞闩讣尹毋札匝丕叱仨仕仟仡仞卮氐刍汀讦讧讪讫阡尕驭匡玑",
            "邢圭圳扪芍亘厍戍曳岌囡缶氘仵伥伧伉伫囟夙旮",
            "刎犷舛凫汕汐汲忖忏讴讷阱阮阪丞妁牟纣纨坂坍坞抉邯芸",
            "芷芮苋芩杓杞杈忑孛邴邳矶豕忒欤轫邶忐邺旰呓呔呖呃旸吡町虬呗吽岐",
            "岈岑岚囵囫钊氙氚牤佞邱攸佚佝佟佗伽彷佘孚豸邸奂狄鸠邹饨饪饫饬亨肓闱闳",
            "闵羌炀沌沏汾汶怃怄忡忤忾怅诅诋诌诏孜陇陀陂妍妩妪妣妊",
            "妞妤邵甬纶纾玥盂抨拈拃坼坻坨坭坳耶",
            "枥枇杳杼奄殁鸢昊昙咂呸昕",
            "咀呷呱呤咚咛呣呦岢岿岫迥岷沓囹罔钗牦竺佰臾岱侃",
            "侩帛阜徂刽怂瓮肽肱剁狙狎咎炙枭饯冽冼庖妾劾火区炖",
            "泷泱泗沱泯泓泾怦怏宕穹宓诓诘戾诙郓衩祆诛诟诠",
            "诣诤诧诩孢妲妯姗弩孥驽虱迦驷驸绉驿甾珏珐珂珑玳珀珉珈拮垣赳贲郝",
            "垓垠茜荚莒茼茴茯荏荃荟荀茗荠荨茹柯柩柚枳",
            "栎枸枷酊郦甭砒砭奎殂殇殄殆轲轶轸哐眍口邦郢眊眈昴",
            "昱昵咦哓哔毗胄虻盅咣剐咻囿咿哙哚咯咩咤哝哞峙帧峒峋峥钚钛钡钨钫氡氟",
            "秕竽笈笃俨俅俪叟俚皈俟徇徉舢俞俎胪胛朐胫鸨匍狩",
            "饷胤孪娈弈奕疣疥庠彦飒闾阂迸籼酋炳炻炽炯烀炷烃洌洇涎洵浒浔",
            "恸恫恺恻恪恽宥衽衿袂祛祜祚祗祢诰诳鸩郡咫弭胥陛陟娅娆姝姘姹怼羿矜绔骁骅",
            "绛骈珣珞琤珲敖埚耆捋盍莆莳莴莠莓莜莅莎莞",
            "鸪桓桧桅豇酐逦厝孬砝砥砣轼鸬虔逍眬",
            "唛晟眩唔晁晏趵蚍蚬蚝蚧圄唣唏盎崂罡罟峪觊赅钰钵钼铀铂铄",
            "氩氤氦舐秣笆倩倏恁倭倪俾倜隼隽臬皋徕舫釜奚衾胯胱胴",
            "胭脍胼朕脒胺玺逖桀袅饽栾挛亳疽疱痂痉衮凋阄恙粑朔郸烨烩烊",
            "烬涟娑涅涓浣浚悚悭悝悒悌宸窈剜诹冢袒祯诿谀谂谄屐奘蚩陲姬娠",
            "娉娲娩娴娣娓逡骊骋绥绦彗焘揶掳埵捭逵掖",
            "掇聃菁萁堇萘萋菽萜萸菟萃菅菀萦梵梏梓啬匮敕酞酚",
            "戛厩龚殒殓殍雩辄堑眭眦眺眸唵冕畦跄蛎蛆蛊",
            "蚱蚴啕啐唷啵啶唰啜崚崦帼崤崆赇赈赊铠铣铮铯铱铳",
            "铵氪逶笺笠笞偾偃偕偻皑皎徜舴舷龛翎脲匐猗猡猞猝斛猕馗鸾",
            "孰庾痔痍疵翊旌旎袤阈阉羟粕敝焐烯烽焖烷焗渍淇淅淞涿淖挲涸淝淬淄惬",
            "惘悸惆惚窕谌谏扈裆谒谕谗谙谛隍隗婧婊婕娼婢袈翌恿绫骐绮绯",
            "绾缁琵琶琪瑛琦琥靓辇鼋揳趄揖颉揄蛰塆掾聒",
            "葸萼葆葩萱戟葭椟椁棣椐鹂厥雯辍辎斐睑睇喋嗒喃",
            "喱喹喈跖跚跎跏跆蛭蛐蛔蛟啾嗖嗟喽喀喔喙嵘嵎崽嵬嵝嵋",
            "铿锂锑锒掣矬氰毽犊犄鹄嵇黍筵牍傥遁徨弑颌翕釉舜貂腌",
            "腓腆腴腑腚腱鱿颍猢猹猥飓觞觚颎馊亵痣痨痞痤痫痧赓竦啻阑阕遒孳焙焱湛",
            "湮渭湍湄滁愠惺惴愀愎愔寐谟扉幂谡谥谧遐孱弼媪媛婷婺",
            "骛彘缈瑁瑜瑕遨骜髡鄢趔摁蜇搪搠摈靳蓦",
            "蓓蓟蓑蒿蒹颐楔楠楫楸槌皙楣椽裘剽甄酮酰酯蜃硼碉碜",
            "龃虞睚韪嗷睨雎睥嘟嗑嗔嗝嗄煦暄遢暌跬跣跹跻蛹嗣嗯嗲嗨",
            "嗤嵩嵴雉歃筱牒煲徭觎貉颔腩腼",
            "詹鲇鲈稣飕觥遛亶痿瘐瘁裔歆雍阖阙豢猷滢溥",
            "裟滂愫慑骞窦褚谩媲嫒嫔缛辔骝缟缢",
            "瑶獒韬髦撂踅墉蔫蔷靼鞅蔟蔺蔻蓿斡榻榭槟",
            "榷酶厮磋臧殡霆霁辕蜚裴翡睿䁖睽嘞嘈嘎暧暝踌蜥蝈蜷蜿螂嘘",
            "嘤幔嶂幛赙罂骷骶锲镁镂犒箍箔箓毓僭睾膈膑",
            "鲛鲟銮塾廖韶粼粽鹚潋漪寤",
            "谮褓暨屣嫣嫖嫦嫡翟鹜骠缨骢缪瑾髯撷撅撸",
            "撺觐鞑蕃槿樊靥魇龉龊瞌瞑噎噘踝",
            "踮踺踞蝼颚噢噜幡嶙骼骸镊镌镍稷箴篌篆磐",
            "膘滕鲠馔麾米查遴糍糅熵熠潸潦潼潺憬憧",
            "熨屦嬉戮磬鞘薨橇樵",
            "橹樽翮醛醐醍赝飙霖霏霓瞟瞠噤踹踽蹉蟒噬噫噻噼",
            "罹镖憩篝篙膳膦邂",
            "瘳斓嬴羲糗瞥燎寰褶禧犟璨璐觳罄",
            "薰翳礅龋龌壑蹊螳蟑羁黜黝黏簌",
            "黛儡鼾邈臆臃鳅鹫襄膺癍濡濯襁孺",
            "隳藩餮瞿躇鹭鹮黠髅镯簪鼬",
            "癞癖蹩懵霭蹶蹴蹾蹿",
            "麒羸瀚骥攘躅黩鳜鳝孀醺礴",
            "懿霾饕麟",
            "壹廠蔔兒幾幹虧與萬",
            "億個麽廣門義屍衛飛習馬鄉豐開無雲專紮藝",
            "廳區曆車貝岡內見氣長幣僅",
            "從侖倉風勻烏鳳爲鬥憶計訂戶認譏醜隊辦鄧",
            "勸雙書擊撲節術厲龍滅軋東盧業舊帥歸",
            "葉電號刀歎們儀叢",
            "爾樂冊處鳥務饑馮閃蘭彙頭漢甯討寫讓禮訓議訊記遼",
            "邊發聖對糾絲動鞏執擴掃場揚亞樸機權過",
            "協壓厭頁誇奪達夾軌堯劃邁畢貞師塵當籲嚇蟲團呂",
            "嗎咬嶼歲豈則剛網丟遷喬偉傳優傷價倫華夥僞",
            "後會殺衆爺傘創雜負爭壯沖妝莊慶劉齊産決閉問",
            "闖並關燈汙湯興講諱軍訝許訛論訟農諷設訪訣尋盡導異孫陣陽階陰",
            "婦媽戲觀歡買紅馱纖馴約級紀馳紉壽麥瑪進遠違韌運撫壇壞摳擾",
            "貢壩掄搶墳護殼塊聲報擬卻蕪葦蒼嚴蘆勞",
            "蘇極楊兩麗醫勵還殲來連軒鹵堅時吳縣裏",
            "嘔園曠圍噸郵員聽嗆嗚別區崗帳財針釘亂禿體",
            "傭妳囪徹鄰腸龜猶狽刪條島",
            "飯飲凍狀畝況庫療應這廬棄閏閑間悶兌竈燦瀝淪洶滄沒溝滬沈",
            "懷憂窮災證啓評補識詐訴診詞譯靈層遲張際陸陳墜",
            "勁雞緯驅純紗綱納駁縱紛紙紋紡驢紐環責現規攏揀擔",
            "頂擁勢攔擰撥擇擡蘋範莖",
            "樞櫃槍楓構傑喪畫臥棗賣礬礦碼廁奮態歐毆壟轟頃轉斬輪軟",
            "齒虜腎賢國暢嚨鳴詠羅幟嶺凱敗賬販貶",
            "購貯圖釣叠稈嶽俠僥偵侶側憑僑貨質徑",
            "覓貪貧膚腫脹脅魚獰備飾飽飼變龐廟瘧",
            "劑廢淨閘鬧鄭單爐淺淚濘瀉潑澤",
            "憐學寶寵審簾實試詩誠襯視話誕詭詢該詳肅錄隸屜屆",
            "彌陝駕三參艱線練組紳細駛織駒終駐絆駝紹繹經貫貳幫",
            "項挾撓趙擋墊掙擠揮荊薦帶繭",
            "蕩榮葷熒蔭藥標棧棟柵欄檸樹鹹磚硯牽鷗",
            "殘軸輕鴉戰點臨覽豎嘗啞顯貴蝦蟻螞雖罵勳嘩",
            "響喲峽罰賤貼鈣鈍鈔鍾鋼鈉鑰欽鈞鈎鈕氈氫選適種複倆",
            "貸順儉須敘劍膽勝脈狹獅獨猙獄",
            "貿餌饒蝕餃餅巒彎將獎瘡瘋親閨聞閩閥閣養類婁茲總煉",
            "爍爛窪潔灑澆濁測濟渾濃惱舉覺宮憲竊誡",
            "誣語襖誤誘誨說誦墾晝費遜隕險嬌賀壘綁絨",
            "結繞驕繪給絢駱絡絕絞駭統豔蠶頑盞撈載趕鹽損",
            "撿換摯熱搗壺恥聶萊蓮獲晉惡瑩棲檔橋樁樣",
            "賈礫礎顧轎較頓斃慮監緊黨曬曉鴨暈",
            "鴦喚罷圓賊賄賂贓錢鉗鑽鉀鐵鈴鉛犧敵積稱",
            "筆筍債傾賃艦艙聳愛頒頌髒",
            "臍膠腦膿鴕鴛皺餓餒淩淒戀槳漿齋離資涼競",
            "閱煩燒燭煙遞濤澇渦塗渙滌潤澗漲燙澀湧憫悅",
            "寬賓竅請諸諾讀誹襪課誰調諒諄談誼剝懇劇娛",
            "難預絹繡驗繼駿瑣撚擲據摻職",
            "黃蘿螢營蕭薩夢檢醞廂矽碩",
            "聾襲輔輛顱虛睜懸躍嘯",
            "嶄邏掘嬰鋁銅銘鏟銀矯稭穢籠償軀釁徒",
            "銜盤鴿斂領腳臉脫夠豬獵貓餡館湊減癢盜",
            "閻闡著蓋斷獸煥鴻漸淵漁澱滲",
            "慚懼驚慘慣窯謀諜謊諧禱禍謂諺謎彈墮隨隱嬸頗頸績緒續",
            "騎綽繩維綿繃綢綜綻綠綴瓊趨攬攙擱摟攪",
            "聯蔥蔣韓橢",
            "廚廈確頰暫翹輩鑿輝賞噴疇踐遺",
            "鵑賦賭贖賜賠鑄鋪鏈銷鎖鋤鍋鏽鋒鋅銳鵝稅築篩",
            "儲粵奧懲禦釋臘魯憊饋饞裝蠻瘓",
            "闊羨糞滯濕溫潰濺灣遊憤",
            "竄窩褲祿謝謠謗謙屬屢強緬纜緝緞緩締縷騙編騷緣",
            "攝擺攜搖攤鵲藍獻樓賴礙",
            "霧輻輯輸頻齡鑒蝸蛻",
            "錯錨錫鑼錘錐錦鍵鋸錳辭頹籌簽簡毀遙膩鵬騰鮑",
            "穎觸雛餾醬癡韻謄糧數滿濾濫滾濱灘譽窺",
            "寢謹謬疊縛縫纏靜贅牆藹",
            "檻釀堿願轄輾顆踴蠟蠅蟬滴賺鍬鍛鍍穩籮輿",
            "鮮饅賽",
            "譚譜騾縮攆撐聰蘊橫櫻飄",
            "黴瞞題蹤蠍囑鎮鎬鎊簍",
            "鯉癟癱凜顔潛瀾額譴鶴",
            "顛櫥轍贈鏡贊籃籬鯨",
            "辯瀕懶繳矚贍",
            "辮贏驟囂鐮鷹顫癬",
            "鼈鱗贛鑲韋",
            "訃劄訖馭",
            "女旭",
            "塢",
            "芝汰曆唉釘",
            "掄拘鄒",
            "噸詛謅隴研",
            "鈕綸",
            "抒砸",
            "押瓜苛巋踏",
            "儈劊慫甕餞洗核區",
            "壟誅",
            "詣詫琺",
            "莢筒伏織",
            "曉剮休羊膿牟幀鋇鎢",
            "葡",
            "孿彥閡熾主烴因旬尋",
            "測婿殊對",
            "秀位",
            "昔",
            "吾皂希撈缽鈾鉑",
            "臯",
            "攣痙鄲燴",
            "燼漣捐辰",
            "聘閑梭騁綏縧擄",
            "貼棺",
            "廄龔隕塹俺蠱",
            "育刷賒銑銥",
            "委箋皚",
            "閹漬泣浙",
            "讒愧",
            "俞蟄彎",
            "霞塔",
            "奎諧揪摟",
            "銻犢",
            "肺闌火",
            "演冪益",
            "擯",
            "薊頤",
            "都咳嘎爹海",
            "稚砍",
            "懾謾",
            "瑤薔族",
            "轅勒躊噓",
            "章鎂",
            "斂",
            "纓",
            "建魯鑷鎳",
            "景",
            "襟塞霹",
            "環喜",
            "齲",
            "貌斑儒",
            "躥",
    };

    private static final String regex = "[a-zA-Z,，?？_\\-(（\\d\\s\\u4e00-\\u9fa5]+";
    private static final String regex2 = "[\\u4e00-\\u9fa5]+";
    private static final Pattern pattern = Pattern.compile(regex);
    private static final Pattern patter2 = Pattern.compile(regex2);


    /**
     * 判定是否是查询词
     * @param str
     * @return
     */
    public static boolean isQueryWord(String str) {
        return pattern.matcher(str).matches();
    }

    /**
     * 判断字符串是否是常用的字，可以用来判定是否乱码
     * @param str 待判断的字符串
     * @return 是常用的字返回true，非乱码也返回true
     */
    public static boolean isFrequentlyUsed(String str) {
        // 去除非中文字符
        StringBuilder sb = new StringBuilder();
        for (int i = 0; i < str.length(); i++) {
            char c = str.charAt(i);
            if (patter2.matcher(c + "").matches()) {
                sb.append(c);
            }
        }

        //判断常用字占比，超过50%，判定是常用的中文字
        String newStr = sb.toString();
        int len = newStr.length();
        int count = 0;
        int ratio = 0;
        if (len > 3) {
            ratio = len/2;
        } else {
            ratio = (len + 1)/2;
        }
        for (int i = 0; i < len; i++) {
            char c = newStr.charAt(i);

            for (int j = 0; j < words.length; j++) {
                if (words[j].indexOf(c) != -1) {
                    count ++;
                    break;
                }
            }

            if (count >= ratio) {
                return true;
            }
        }

        return false;
    }

    public static void main(String[] args) throws IOException {

        String aa = "鍥涘钩闈掑勾2浜岄緳婀栨旦鍝箣椋庝簯鍐嶈捣";
//        aa = "浠界瀹瑙缁娴 版锛娆";
//        aa = "毒霸网址大全，最安全实用的网址导";
//        aa = "領収書";
        aa = "(你_好";
//        long start = System.currentTimeMillis();
//        boolean frequentlyUsed = isFrequentlyUsed(aa);
//        long end = System.currentTimeMillis();
//        System.out.println(end - start);
//        System.out.println(
//                frequentlyUsed
//        );

        System.out.println(isQueryWord(aa));
        System.out.println(isFrequentlyUsed(aa));

    }
}
